////格式化控制
//#include <iostream>
//using namespace std;
//int main() {
//	float f = 20.2;
//	//以科学计数法输出，输出十六进制时字母均是大写
//	cout.setf(ios::scientific | ios::uppercase);
//	cout << "f = " << f << endl;
//
//	//用flags（）函数获取当前的流状态标志
//	cout << "第一次获取流状态标志： " << cout.flags() << endl;
//	cout.flags(ios::showpos);//将先前的状态标志都清楚，设置showpos标志
//	//再次调用flags函数获取当前的流状态标志
//	cout << "第二次获取流状态标志： " << cout.flags() << endl;
//	cout << "设置showpos后， f = " << f << endl;
//	//在调用unsetf函数清除流状态标志
//	cout.unsetf(ios::showpos);
//	cout << "清除showpos标志后为 f=  " << f << endl;
//	system("pause");
//	return 0;
//}
///*
//没有把你照顾好
//骄傲 是脆弱的外表
//最怕我的心你不要
//能不能继续
//对我哭 对我笑 对我好
//继续让我
//为你想 为你疯 陪你老
//你好不好 好想知道
//别急着把回忆都丢掉
//我只需要你 在身边
//陪我吵 陪我闹
//用好的我 把过去 坏的我
//都换掉
//好想听到 你坚决说爱我
//可惜回不去那一秒
//你好不好
//天知道 我快要受不了
//后悔钻进心里烧
//拥抱 再多一次就好
//你要的我都做得到
//能不能继续
//对我哭 对我笑 对我好
//继续让我
//为你想 为你疯 陪你老
//给你的好 还要不要
//答案我却不敢揭晓
//我只需要你 在身边
//陪我吵 陪我闹
//别用离开教我
//失去的人最重要
//别说 你曾经爱过我
//让我们回到那一秒
//你好不好
//能不能继续
//对我哭 对我笑 对我好
//继续让我
//为你想 为你疯 陪你老
//你好不好 我好想知道
//别急着把我的爱丢掉
//我只需要你 在身边
//陪我吵 陪我闹
//别用离开教我
//失去的人最重要
//别说 你曾经爱过我
//让我们回到那一秒
//你好不好*/
//
